YuzheJi/ELEC-291-project-2/EFM8_JDY40_test_Slave/main.c
#include <EFM8LB1.h>
#include <stdlib.h>
#include <stdio.h>
#include <stdint.h>
#include <math.h>
#include <string.h>
#include "freq.h"

#define SYSCLK 72000000L // SYSCLK frequency in Hz
#define BAUDRATE 115200L
#define SARCLK 18000000L
#define RELOAD_10us (0x10000L-(SYSCLK/(12L*100000L))) // 10us rate
#define TIMER_0_FREQ 2000L // For a 0.5ms tick
#define F_SCK_MAX 2000000L   // SPI SCK 


//                                    ----------  
// 	                    P0.0      1  |          |  32      P0.1     
//                      GND       2  |          |  31      P0.2  	
//                      5V        3  |          |  30      P0.3  	SCK
//                      5V        4  |          |  29      P0.4  	xxxxx
//                      RST       5  |          |  28      P0.5  	xxxxx
//                      P3.7      6  |          |  27      P0.6  	SDO (MISO)
// ECHO                 P3.3      7  |          |  26      P0.7  	SDI (MOSI)
// TRIGGER              P3.2      8  |          |  25      P1.0  	CS
//                      P3.1      9  |          |  24      P1.1  	RXD (MCU: TXD)
// Coin detector        P3.0     10  |          |  23      P1.2  	TXD (MCU: RXD)
// Load_Data            P2.6     11  |          |  22      P1.3     Boundary1
// Load_SCK             P2.5     12  |          |  21      P1.4  	Boundary2
// R_bridge_2           P2.4     13  |          |  20      P1.5  	Magnet
// R_bridge_1           P2.3     14  |          |  19      P1.6  	Servo_arm
// L_bridge_2           P2.2     15  |          |  18      P1.7  	Servo_base
// L_bridge_1           P2.1     16  |          |  17      P2.0     RF_SET
//                                    ----------  

// Definitions
#define R_bridge_1		P2_4
#define R_bridge_2		P2_3
#define L_bridge_2		P2_2
#define L_bridge_1 		P2_1
#define Servo_base 		P1_7
#define Servo_arm  		P1_6
#define Magnet 	   		P1_5
#define CS 		   		P1_0
#define DOUT 	   		P2_6  // Data output (DOUT pin)
#define PD_SCK 	   		P2_5 // Pulse to initiate conversion (PD_SCK pin)
#define ECHO_PIN   		P3_1
#define TRIG_PIN		P0_0

// Constant Definitions
#define M_PI 3.14159265358979323846

// BMM150 Registers 
#define BMM150_CHIP_ID          			0x40 // the chip identification number 0x32 -> read only if 0x4B bit enabled
#define BMM150_DATA_X_LSB       			0x42 // X axis
#define BMM150_DATA_X_MSB       			0x43
#define BMM150_DATA_Y_LSB       			0x44 // Y axis
#define BMM150_DATA_Y_MSB       			0x45
#define BMM150_DATA_Z_LSB       			0x46 // Z axis
#define BMM150_DATA_Z_MSB       			0x47
#define BMM150_RHALL_LSB        			0x48 // hall resistance and Data Ready (DRDT) status bit
#define BMM150_RHALL_MSB        			0x49 // hall resistance 
#define BMM150_STATUS_REGISTER  			0x4A 
#define BMM150_POWER_CONTROL    			0x4B 
#define BMM150_OP_MODE          			0x4C
#define BMM150_INTERRUPT        			0x4D
#define BMM150_REP_XY           			0x51
#define BMM150_REP_Z            			0x52
#define BMM150_DIG_X1						0x5D
#define BMM150_DIG_Z4_LSB					0x62
#define BMM150_DIG_Z2_LSB					0x68

// BMM150 Constants
#define BMM150_CHIP_ID_VALUE    			0x32
#define BMM150_POWER_ON         			0x01
#define BMM150_NORMAL_MODE      			0x00
#define BMM150_ODR_10HZ         			0x00  // Output data rate 10Hz
#define BMM150_DATA_READY       			0x01
#define BMM150_OVERFLOW_OUTPUT				-32768
#define BMM150_OVERFLOW_ADCVAL_XYAXES_FLIP	INT16_C(-4096)
#define BMM150_OVERFLOW_ADCVAL_ZAXIS_HALL 	INT16_C(-16384)
#define BMM150_POSITIVE_SATURATION_Z 		INT16_C(32767)
#define BMM150_NEGATIVE_SATURATION_Z 		INT16_C(-32767)

// Global variables 
idata char buff[20];
xdata unsigned int pwm_counter = 0; 
xdata unsigned int servo_counter = 0; 
xdata unsigned char pwm_left = 0, pwm_right = 0; 
xdata unsigned char L_motor_dir = 1, R_motor_dir = 1; // 1 - Forward, 0 - Backward
xdata unsigned char servo_base = 50, servo_arm = 50; 
xdata int vx_thres = 161, vy_thres = 166; 
xdata int vx = 0, vy = 0; 
xdata long freq100;
xdata unsigned int fre_mea_count = 0;
xdata unsigned int weight_mea_count = 0;
xdata int d1, d2;
xdata unsigned int seed = 12345;
xdata float pwm_corr = 0.95;
//BMM150 Global Variables
xdata int8_t dig_x1, dig_x2, dig_y1, dig_y2; 
xdata uint16_t  dig_z1, dig_z2, dig_z3, dig_z4;
xdata uint8_t dig_xy1; 
xdata int8_t dig_xy2; 
xdata uint16_t dig_xyz1; 
xdata float curr_angle = 0.0, raw_angle = 0.0, last_raw_angle = 0.0, angle_diff = 0.0; 
xdata char mea_yes = 1;

xdata unsigned int weight = 0;
xdata float temp; 
xdata float duration=0.0;
xdata int distance;
xdata unsigned char overflow_count; 

xdata int i_loo;


char _c51_external_startup (void)
{
	// Disable Watchdog with key sequence
	SFRPAGE = 0x00;
	WDTCN = 0xDE; //First key
	WDTCN = 0xAD; //Second key
  
	VDM0CN=0x80;       // enable VDD monitor
	RSTSRC=0x02|0x04;  // Enable reset on missing clock detector and VDD

	#if (SYSCLK == 48000000L)	
		SFRPAGE = 0x10;
		PFE0CN  = 0x10; // SYSCLK < 50 MHz.
		SFRPAGE = 0x00;
	#elif (SYSCLK == 72000000L)
		SFRPAGE = 0x10;
		PFE0CN  = 0x20; // SYSCLK < 75 MHz.
		SFRPAGE = 0x00;
	#endif
	
	#if (SYSCLK == 12250000L)
		CLKSEL = 0x10;
		CLKSEL = 0x10;
		while ((CLKSEL & 0x80) == 0);
	#elif (SYSCLK == 24500000L)
		CLKSEL = 0x00;
		CLKSEL = 0x00;
		while ((CLKSEL & 0x80) == 0);
	#elif (SYSCLK == 48000000L)	
		// Before setting clock to 48 MHz, must transition to 24.5 MHz first
		CLKSEL = 0x00;
		CLKSEL = 0x00;
		while ((CLKSEL & 0x80) == 0);
		CLKSEL = 0x07;
		CLKSEL = 0x07;
		while ((CLKSEL & 0x80) == 0);
	#elif (SYSCLK == 72000000L)
		// Before setting clock to 72 MHz, must transition to 24.5 MHz first
		CLKSEL = 0x00;
		CLKSEL = 0x00;
		while ((CLKSEL & 0x80) == 0);
		CLKSEL = 0x03;
		CLKSEL = 0x03;
		while ((CLKSEL & 0x80) == 0);
	#else
		#error SYSCLK must be either 12250000L, 24500000L, 48000000L, or 72000000L
	#endif


	P0MDOUT |= 0b_1100_0000;
	P1MDOUT |= 0b_0000_0110;
	P2MDOUT |= 0b_0000_0001; // P2.0 in push-pull mode
	XBR0     = 0b_0000_0011; // UART0E = 1 and SPI0E = 1 0b_0000_0011               
	XBR1     = 0b_0000_0000;
	XBR2     = 0b_0100_0001; // Enable crossbar and uart 1
	P0SKIP 	 = 0b_0000_0111; 
	P1SKIP   = 0b_1111_1001;
	// Configure Uart 0
	#if (((SYSCLK/BAUDRATE)/(2L*12L))>0xFFL)
		#error Timer 0 reload value is incorrect because (SYSCLK/BAUDRATE)/(2L*12L) > 0xFF
	#endif
	SCON0 = 0x10;
	TH1 = 0x100-((SYSCLK/BAUDRATE)/(2L*12L));
	TL1 = TH1;      // Init Timer1
	TMOD &= ~0xf0;  // TMOD: timer 1 in 8-bit auto-reload
	TMOD |=  0x20;                       
	TR1 = 1; // START Timer1
	TI = 1;  // Indicate TX0 ready
  	P2_0=1; // 'set' pin to 1 is normal operation mode.

	// Configure SPI
    SPI0CKR = (SYSCLK/(2*F_SCK_MAX))-1;
    SPI0CFG = 0b_1110_0000; // SPI mode 3
    SPI0CN0 = 0b_0000_0001; // SPI enabled and in three wire mode

