YuzheJi/ELEC-291-project-2/EFM8_JDY40_test_Slave/main.c
	answer = 100 * (340.0 * duration * 100.0 / 2.0); // distance in cm
	
	return answer; 
}

void Set_Pin_Output (unsigned char pin)
{
	unsigned char mask;
	
	mask=(1<<(pin&0x7));
	switch(pin/0x10)
	{
		case 0: P0MDOUT |= mask; break;
		case 1: P1MDOUT |= mask; break;
		case 2: P2MDOUT |= mask; break; 
		case 3: P3MDOUT |= mask; break; 
	}	
}

void Set_Pin_Input (unsigned char pin)
{
	xdata unsigned char mask;
	
	mask=(1<<(pin&0x7));
	mask=~mask;
	switch(pin/0x10)
	{
		case 0: P0MDOUT &= mask; break;
		case 1: P1MDOUT &= mask; break;
		case 2: P2MDOUT &= mask; break; 
		case 3: P3MDOUT &= mask; break; 
	}	
}

void InitADC (void)
{
	SFRPAGE = 0x00;
	ADEN=0; // Disable ADC
	
	ADC0CN1=
		(0x2 << 6) | // 0x0: 10-bit, 0x1: 12-bit, 0x2: 14-bit
        (0x0 << 3) | // 0x0: No shift. 0x1: Shift right 1 bit. 0x2: Shift right 2 bits. 0x3: Shift right 3 bits.		
		(0x0 << 0) ; // Accumulate n conversions: 0x0: 1, 0x1:4, 0x2:8, 0x3:16, 0x4:32
	
	ADC0CF0=
	    ((SYSCLK/SARCLK) << 3) | // SAR Clock Divider. Max is 18MHz. Fsarclk = (Fadcclk) / (ADSC + 1)
		(0x0 << 2); // 0:SYSCLK ADCCLK = SYSCLK. 1:HFOSC0 ADCCLK = HFOSC0.
	
	ADC0CF1=
		(0 << 7)   | // 0: Disable low power mode. 1: Enable low power mode.
		(0x1E << 0); // Conversion Tracking Time. Tadtk = ADTK / (Fsarclk)
	
	ADC0CN0 =
		(0x0 << 7) | // ADEN. 0: Disable ADC0. 1: Enable ADC0.
		(0x0 << 6) | // IPOEN. 0: Keep ADC powered on when ADEN is 1. 1: Power down when ADC is idle.
		(0x0 << 5) | // ADINT. Set by hardware upon completion of a data conversion. Must be cleared by firmware.
		(0x0 << 4) | // ADBUSY. Writing 1 to this bit initiates an ADC conversion when ADCM = 000. This bit should not be polled to indicate when a conversion is complete. Instead, the ADINT bit should be used when polling for conversion completion.
		(0x0 << 3) | // ADWINT. Set by hardware when the contents of ADC0H:ADC0L fall within the window specified by ADC0GTH:ADC0GTL and ADC0LTH:ADC0LTL. Can trigger an interrupt. Must be cleared by firmware.
		(0x0 << 2) | // ADGN (Gain Control). 0x0: PGA gain=1. 0x1: PGA gain=0.75. 0x2: PGA gain=0.5. 0x3: PGA gain=0.25.
		(0x0 << 0) ; // TEMPE. 0: Disable the Temperature Sensor. 1: Enable the Temperature Sensor.

	ADC0CF2= 
		(0x0 << 7) | // GNDSL. 0: reference is the GND pin. 1: reference is the AGND pin.
		(0x1 << 5) | // REFSL. 0x0: VREF pin (external or on-chip). 0x1: VDD pin. 0x2: 1.8V. 0x3: internal voltage reference.
		(0x1F << 0); // ADPWR. Power Up Delay Time. Tpwrtime = ((4 * (ADPWR + 1)) + 2) / (Fadcclk)
	
	ADC0CN2 =
		(0x0 << 7) | // PACEN. 0x0: The ADC accumulator is over-written.  0x1: The ADC accumulator adds to results.
		(0x0 << 0) ; // ADCM. 0x0: ADBUSY, 0x1: TIMER0, 0x2: TIMER2, 0x3: TIMER3, 0x4: CNVSTR, 0x5: CEX5, 0x6: TIMER4, 0x7: TIMER5, 0x8: CLU0, 0x9: CLU1, 0xA: CLU2, 0xB: CLU3

	ADEN=1; // Enable ADC
}

void InitPinADC (unsigned char portno, unsigned char pin_num)
{
	unsigned char mask;
	
	mask=1<<pin_num;

	SFRPAGE = 0x20;
	switch (portno)
	{
		case 0:
			P0MDIN &= (~mask); // Set pin as analog input
			P0SKIP |= mask; // Skip Crossbar decoding for this pin
		break;
		case 1:
			P1MDIN &= (~mask); // Set pin as analog input
			P1SKIP |= mask; // Skip Crossbar decoding for this pin
		break;
		case 2:
			P2MDIN &= (~mask); // Set pin as analog input
			P2SKIP |= mask; // Skip Crossbar decoding for this pin
		break;
		default:
		break;
	}
	SFRPAGE = 0x00;
}

unsigned int ADC_at_Pin(unsigned char pin)
{
	ADC0MX = pin;   // Select input from pin
	ADINT = 0;
	ADBUSY = 1;     // Convert voltage at the pin
	while (!ADINT); // Wait for conversion to complete
	return (ADC0);
}

int ReadHX711(void) {
    xdata unsigned long dataa = 0;
    xdata char i;
	xdata unsigned int ans = 0;
	xdata volatile char j;

	PD_SCK = 0;

    for (i = 0; i < 24; i++) {
        PD_SCK = 1;
        for (j = 0; j < 4; j++);
        dataa = dataa << 1;
        if (DOUT) {
            dataa |= 0x01;
        }
        PD_SCK = 0;
        for (j = 0; j < 4; j++);
    }

    PD_SCK = 1;
    for (j = 0; j < 4; j++);
    PD_SCK = 0;
    for (j = 0; j < 4; j++);
	ans = (dataa % 1000000)/10;
    return ans;
}

void Timer5_ISR (void) interrupt INTERRUPT_TIMER5
{
	SFRPAGE=0x10;
	TF5H = 0; // Clear Timer5 interrupt flag
	TMR5RL = RELOAD_10us; // Reload Timer5 for 10us intervals 

	fre_mea_count++;
	if(fre_mea_count == 1000){
		fre_mea_count = 0;
		if(mea_yes){
			freq100 = get_freq();
			
		}
	}

	weight_mea_count++;
	if(weight_mea_count == 20000){
		weight_mea_count = 0;
		distance = measure_distance();
		if(mea_yes) weight = ReadHX711();
	}

    pwm_counter++; 
    if (pwm_counter == 100){
        pwm_counter = 0; 
    }

    if (pwm_right > pwm_counter){
        if(L_motor_dir){
            L_bridge_1 = 1; 
            L_bridge_2 = 0; 
        }
        else {
            L_bridge_1 = 0; 
            L_bridge_2 = 1; 
        }
    }
    else {
        L_bridge_1 = 0; 
        L_bridge_2 = 0; 
    }
    if (pwm_left > pwm_counter){
        if (R_motor_dir){
            R_bridge_1 = 1; 
            R_bridge_2 = 0;
        } 
        else {
            R_bridge_1 = 0; 
            R_bridge_2 = 1;
        }
    }
    else {
        R_bridge_1 = 0; 
        R_bridge_2 = 0; 
    }

	servo_counter++;
	if(servo_counter==2000)
	{
		servo_counter=0;
		Servo_arm=1;
		Servo_base=1;
	}
	if(servo_arm>=servo_counter)
	{
		Servo_arm = 1;
	}
	else 
	{
		Servo_arm = 0; 
	}
	if(servo_base>=servo_counter)
	{
		Servo_base = 1;
	}
	else 
	{
		Servo_base = 0; 
	}
}

void servo_pick(){
	servo_arm = 50;
	servo_base = 50;
	waitms(500);
	// servo_base = 250;
	for (i_loo=50; i_loo <= 210; i_loo+=20)
	{
		servo_base = i_loo; 
		waitms(25);
	}
	waitms(500);
	for(i_loo = 50; i_loo <= 250; i_loo+=20)
	{
		servo_arm = i_loo; 
		waitms(25);
	}
	// servo_arm = 250; 
	Magnet = 1; 
	waitms(500);
	for(i_loo = 200; i_loo >= 90; i_loo-=10){
		waitms(25);
		servo_base = i_loo;
	}
	waitms(500);
	for(i_loo = 90; i_loo <= 200; i_loo+=10){
		waitms(25);
		servo_base = i_loo;
	}
	waitms(500);
	for(i_loo = 240; i_loo >= 100; i_loo-= 5){
		waitms(25);
		servo_arm = i_loo;
	}
	waitms(500);
	for(i_loo = 200; i_loo >= 80; i_loo-=5){
		waitms(25);
		servo_base = i_loo;
	}
	waitms(500);
	Magnet = 0;
	waitms(500);
	for (i_loo = 100; i_loo >=40 ; i_loo-=10){
		servo_arm = i_loo; 
		waitms(25);
	}
	waitms(500);
	for (i_loo = 80; i_loo >= 40; i_loo-=10){
		servo_base = i_loo; 
		waitms(25);
	}
	return;
}

int check_bound(int d1, int d2){
	if(d1>10000||d2>10000)	return 1;
	else return 0;
}

void Init_all(){

